zephyrproject-rtos/zephyr/drivers/pinmux/stm32/pinmux_stm32g031xx.h
/*
 * Copyright (c) 2020 Framework Computer - Kieran Levin <ktl@frame.work>
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_DRIVERS_PINMUX_STM32_PINMUX_STM32G031XX_H_
#define ZEPHYR_DRIVERS_PINMUX_STM32_PINMUX_STM32G031XX_H_

/* PORT A */

#define STM32G0_PINMUX_FUNC_PA0_TIM2_CH1_ETR \
		(STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)

#define STM32G0_PINMUX_FUNC_PA0_LPTIM1_OUT \
		(STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PA1_TIM2_CH2 \
		(STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PA2_TIM2_CH3 \
		(STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)

#define STM32G0_PINMUX_FUNC_PA2_LPUART1_TX \
		(STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PA3_TIM2_CH4 \
		(STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)

#define STM32G0_PINMUX_FUNC_PA3_LPUART1_RX \
		(STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PA4_LPTIM2_OUT \
		(STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PA5_TIM2_CH1_ETR \
		(STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)

#define STM32G0_PINMUX_FUNC_PA5_LPTIM2_ETR \
		(STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PA6_LPUART1_CTS \
		(STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PA7_TIM14_CH1 \
		(STM32_PINMUX_ALT_FUNC_3 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)

#define STM32G0_PINMUX_FUNC_PA7_TIM17_CH1 \
		(STM32_PINMUX_ALT_FUNC_4 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PA8_LPTIM2_OUT \
		(STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PA15_TIM2_CH1_ETR \
		(STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)

/* PORT B */

#define STM32G0_PINMUX_FUNC_PB0_LPTIM1_OUT \
		(STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PB1_LPTIM2_IN1 \
		(STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)

#define STM32G0_PINMUX_FUNC_PB1_LPUART1_RTS_DE \
		(STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PB2_LPTIM1_OUT \
		(STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PB3_TIM2_CH2 \
		(STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PB5_LPTIM1_IN1 \
		(STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PB6_LPTIM1_ETR \
		(STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PB7_LPTIM1_IN2 \
		(STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PB10_LPUART1_RX \
		(STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)

#define STM32G0_PINMUX_FUNC_PB10_TIM2_CH3 \
		(STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PB11_LPUART1_TX \
		(STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)

#define STM32G0_PINMUX_FUNC_PB11_TIM2_CH4 \
		(STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PB12_LPUART1_RTS_DE \
		(STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PB13_LPUART1_CTS \
		(STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)

/* PORT C */

#define STM32G0_PINMUX_FUNC_PC6_TIM2_CH3 \
		(STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)


#define STM32G0_PINMUX_FUNC_PC7_TIM2_CH4 \
		(STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)

/* PORT F */

#define STM32G0_PINMUX_FUNC_PF2_MCO \
		(STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)

#endif /* ZEPHYR_DRIVERS_PINMUX_STM32_PINMUX_STM32G031XX_H_ */
